thumb2/nrf51sdk12_3/components/libraries/block_dev/qspi/nrf_block_dev_qspi.c
    size_t blk = p_blk_left->blk_id %
                 BD_BLOCKS_PER_ERASEUNIT(p_work->geometry.blk_size);
    size_t cnt = BD_BLOCKS_PER_ERASEUNIT(p_work->geometry.blk_size) - blk;
    size_t off = p_work->geometry.blk_size * blk;

    if (cnt > p_blk_left->blk_count) {
        cnt = p_blk_left->blk_count;
    }

    bool erase_required = block_dev_qspi_update_eunit(p_qspi_dev,
                          off,
                          p_blk_left->p_buff,
                          cnt * p_work->geometry.blk_size);
    if (erase_required) {
        p_work->erase_required = true;
    }

    p_blk_left->blk_count -= cnt;
    p_blk_left->blk_id += cnt;
    p_blk_left->p_buff = (uint8_t *)p_blk_left->p_buff + cnt * p_work->geometry.blk_size;

    if (p_work->erase_required) {
        uint32_t blk_size = p_work->geometry.blk_size;
        p_work->erase_unit_dirty_blocks |= (1u << BD_BLOCKS_PER_ERASEUNIT(blk_size)) - 1;
    }

    if (p_work->erase_unit_dirty_blocks == 0 || p_work->writeback_mode) {
        /*No dirty blocks detected. Write end.*/
        if (p_work->ev_handler && p_blk_left->blk_count == 0) {
            const nrf_block_dev_event_t ev = {
                NRF_BLOCK_DEV_EVT_BLK_WRITE_DONE,
                NRF_BLOCK_DEV_RESULT_SUCCESS,
                &p_work->req,
                p_work->p_context
            };


            p_work->state = NRF_BLOCK_DEV_QSPI_STATE_IDLE;
            p_work->ev_handler(&p_qspi_dev->block_dev, &ev);
            return NRF_SUCCESS;
        }
    }

    return block_dev_qspi_write_start(p_qspi_dev);
}

static ret_code_t block_dev_qspi_write_req(nrf_block_dev_t const * p_blk_dev,
        nrf_block_req_t const * p_blk)
{
    ASSERT(p_blk_dev);
    ASSERT(p_blk);
    nrf_block_dev_qspi_t const * p_qspi_dev =
        CONTAINER_OF(p_blk_dev, nrf_block_dev_qspi_t, block_dev);
    nrf_block_dev_qspi_work_t *  p_work = p_qspi_dev->p_work;

    ret_code_t ret = NRF_SUCCESS;

    if (m_active_qspi_dev != p_qspi_dev) {
        /* QSPI instance is BUSY*/
        return NRF_ERROR_BUSY;
    }

    if (p_work->state != NRF_BLOCK_DEV_QSPI_STATE_IDLE) {
        /* Previous asynchronous operation in progress*/
        return NRF_ERROR_BUSY;
    }

    p_work->left_req = *p_blk;
    p_work->req = *p_blk;

    nrf_block_req_t * p_blk_left = &p_work->left_req;

    uint32_t erase_unit = BD_BLOCK_TO_ERASEUNIT(p_blk_left->blk_id,
                          p_work->geometry.blk_size);

    /* Check if block is in erase unit buffer*/
    if (erase_unit == p_work->erase_unit_idx) {
        ret = block_dev_qspi_eunit_write(p_qspi_dev, p_blk_left);
    } else {
        if (p_work->writeback_mode) {
            ret = block_dev_qspi_write_start(p_qspi_dev);
        } else {
            p_work->erase_unit_idx = erase_unit;
            p_work->state = NRF_BLOCK_DEV_QSPI_STATE_EUNIT_LOAD;

            ret = nrf_drv_qspi_read(p_work->p_erase_unit_buff,
                                    NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE,
                                    erase_unit * NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE);
        }
    }

    if (ret != NRF_SUCCESS) {
        p_work->state = NRF_BLOCK_DEV_QSPI_STATE_IDLE;
        return ret;
    }

    if (!p_work->ev_handler && (p_work->state != NRF_BLOCK_DEV_QSPI_STATE_IDLE)) {
        /*Synchronous operation*/
        wait_for_idle(p_qspi_dev);
    }

    return ret;
}

static ret_code_t block_dev_qspi_ioctl(nrf_block_dev_t const * p_blk_dev,
                                       nrf_block_dev_ioctl_req_t req,
                                       void * p_data)
{
    ASSERT(p_blk_dev);
    nrf_block_dev_qspi_t const * p_qspi_dev =
        CONTAINER_OF(p_blk_dev, nrf_block_dev_qspi_t, block_dev);
    nrf_block_dev_qspi_work_t *  p_work = p_qspi_dev->p_work;

    switch (req) {
    case NRF_BLOCK_DEV_IOCTL_REQ_CACHE_FLUSH: {
        bool * p_flushing = p_data;
        if (p_work->state != NRF_BLOCK_DEV_QSPI_STATE_IDLE) {
            return NRF_ERROR_BUSY;
        }

        if (!p_work->writeback_mode || p_work->erase_unit_dirty_blocks == 0) {
            if (p_flushing) {
                *p_flushing = false;
            }

            return NRF_SUCCESS;
        }

        ret_code_t ret =  block_dev_qspi_write_start(p_qspi_dev);
        if (ret == NRF_SUCCESS) {
            if (p_flushing) {
                *p_flushing = true;
            }
            p_work->cache_flushing = true;
        }

        return ret;
    }
    case NRF_BLOCK_DEV_IOCTL_REQ_INFO_STRINGS: {
        if (p_data == NULL) {
            return NRF_ERROR_INVALID_PARAM;
        }

        nrf_block_dev_info_strings_t const ** pp_strings = p_data;
        *pp_strings = &p_qspi_dev->info_strings;
        return NRF_SUCCESS;
    }
    default:
        break;
    }

    return NRF_ERROR_NOT_SUPPORTED;
}

static nrf_block_dev_geometry_t const * block_dev_qspi_geometry(nrf_block_dev_t const * p_blk_dev)
{
    ASSERT(p_blk_dev);
    nrf_block_dev_qspi_t const * p_qspi_dev =
        CONTAINER_OF(p_blk_dev, nrf_block_dev_qspi_t, block_dev);
    nrf_block_dev_qspi_work_t const * p_work = p_qspi_dev->p_work;

    return &p_work->geometry;
}

const nrf_block_dev_ops_t nrf_block_device_qspi_ops = {
    .init = block_dev_qspi_init,
    .uninit = block_dev_qspi_uninit,
    .read_req = block_dev_qspi_read_req,
    .write_req = block_dev_qspi_write_req,
    .ioctl = block_dev_qspi_ioctl,
    .geometry = block_dev_qspi_geometry,
};


/** @} */
